CSI API ETABS v1

# cLoadCasesDirHistNonlinear Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseDirectHistoryNonlinear DirHistNonlinear { get; }

    ReadOnly Property DirHistNonlinear As cCaseDirectHistoryNonlinear
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseDirectHistoryNonlinear

    value = instance.DirHistNonlinear

    property cCaseDirectHistoryNonlinear^ DirHistNonlinear {
    	cCaseDirectHistoryNonlinear^ get ();
    }

    abstract DirHistNonlinear : cCaseDirectHistoryNonlinear with get

#### Property Value

Type: cCaseDirectHistoryNonlinear

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com